Repository: sivyrn/Capso
Catalog: App/Resources/Localizable.xcstrings
Source language: en
Languages: ja, ko, zh_hans

source: The editor will close when the export is finished.
ja: 書き出し完了後、エディタは閉じます。
ko: 내보내기가 완료되면 편집기가 닫힙니다.
zh_hans: 导出完成后编辑器将关闭。

source: Copying…
ja: コピー中…
ko: 복사 중…
zh_hans: 正在复制…

source: Saving…
ja: 保存中…
ko: 저장 중…
zh_hans: 正在保存…

source: Couldn't copy recording
ja: 録画をコピーできませんでした
ko: 녹화본을 복사할 수 없습니다
zh_hans: 无法复制录像

source: Add Custom Ratio
ja: カスタム比率を追加
ko: 사용자 지정 비율 추가
zh_hans: 添加自定义比例

source: Add Custom Ratio…
ja: カスタム比率を追加…
ko: 사용자 지정 비율 추가…
zh_hans: 添加自定义比例…

source: Flip horizontally
ja: 左右反転
ko: 좌우 반전
zh_hans: 水平翻转

source: Flip is disabled while annotations are present
ja: 注釈がある間は反転を使用できません
ko: 주석이 있는 동안에는 뒤집기를 사용할 수 없습니다
zh_hans: 存在标注时无法翻转

source: Height in pixels
ja: 高さ（ピクセル）
ko: 높이 (픽셀)
zh_hans: 高度（像素）

source: Height
ja: 高さ
ko: 높이
zh_hans: 高度

source: Rotate 90° counter-clockwise
ja: 反時計回りに 90° 回転
ko: 반시계 방향으로 90° 회전
zh_hans: 逆时针旋转 90°

source: Rotate is disabled while annotations are present
ja: 注釈がある間は回転を使用できません
ko: 주석이 있는 동안에는 회전을 사용할 수 없습니다
zh_hans: 存在标注时无法旋转

source: Width in pixels
ja: 幅（ピクセル）
ko: 너비 (픽셀)
zh_hans: 宽度（像素）

source: Width
ja: 幅
ko: 너비
zh_hans: 宽度

source: Upload to Cloud
ja: クラウドにアップロード
ko: 클라우드에 업로드
zh_hans: 上传到云端

source: Link Copied!
ja: リンクをコピーしました！
ko: 링크가 복사되었습니다!
zh_hans: 链接已复制！

source: Upload screenshot to cloud and copy link
ja: スクリーンショットをクラウドにアップロードしてリンクをコピー
ko: 스크린샷을 클라우드에 업로드하고 링크 복사
zh_hans: 上传截图到云端并复制链接

source: Link has been copied to clipboard
ja: リンクがクリップボードにコピーされました
ko: 링크가 클립보드에 복사되었습니다
zh_hans: 链接已复制到剪贴板

source: Retry
ja: 再試行
ko: 다시 시도
zh_hans: 重试

source: Cloud credentials are invalid. Open Settings to fix.
ja: クラウドの認証情報が無効です。設定を開いて修正してください。
ko: 클라우드 자격 증명이 유효하지 않습니다. 설정을 열어 수정하세요.
zh_hans: 云端凭证无效，请打开设置修复。

source: Upload failed — network error: %@
ja: アップロード失敗 — ネットワークエラー: %@
ko: 업로드 실패 — 네트워크 오류: %@
zh_hans: 上传失败 — 网络错误：%@

source: Cloud quota exceeded.
ja: クラウドのストレージ容量を超えました。
ko: 클라우드 저장 공간이 초과되었습니다.
zh_hans: 云端存储配额已满。

source: Upload OK but public URL unreachable. Check bucket settings.
ja: アップロードは成功しましたが、公開 URL にアクセスできません。バケットの設定を確認してください。
ko: 업로드는 성공했지만 공개 URL에 접근할 수 없습니다. 버킷 설정을 확인하세요.
zh_hans: 上传成功，但公开 URL 无法访问，请检查存储桶设置。

source: Cloud URL prefix is invalid: %@
ja: クラウド URL プレフィックスが無効です: %@
ko: 클라우드 URL 접두사가 유효하지 않습니다: %@
zh_hans: 云端 URL 前缀无效：%@

source: Cloud sharing is not configured.
ja: クラウド共有が設定されていません。
ko: 클라우드 공유가 설정되지 않았습니다.
zh_hans: 云端分享尚未配置。

source: Upload failed: %@
ja: アップロード失敗: %@
ko: 업로드 실패: %@
zh_hans: 上传失败：%@

source: Cloud Share is not set up yet
ja: クラウド共有はまだ設定されていません
ko: 클라우드 공유가 아직 설정되지 않았습니다
zh_hans: 云端分享尚未设置

source: Configure a Cloudflare R2 bucket to share captures with one click.
ja: Cloudflare R2 バケットを設定して、ワンクリックでキャプチャを共有できます。
ko: Cloudflare R2 버킷을 설정하면 한 번의 클릭으로 캡처를 공유할 수 있습니다.
zh_hans: 配置 Cloudflare R2 存储桶，一键分享截图。

source: Set up Cloud Share
ja: クラウド共有を設定
ko: 클라우드 공유 설정
zh_hans: 设置云端分享

source: Testing…
ja: テスト中…
ko: 테스트 중…
zh_hans: 测试中…

source: Test
ja: テスト
ko: 테스트
zh_hans: 测试

source: Reset
ja: リセット
ko: 재설정
zh_hans: 重置

source: Not configured
ja: 未設定
ko: 설정되지 않음
zh_hans: 未配置

source: Cloud Share isn't fully set up yet — re-run the wizard.
ja: クラウド共有の設定が完了していません — ウィザードを再実行してください。
ko: 클라우드 공유 설정이 완료되지 않았습니다 — 마법사를 다시 실행하세요.
zh_hans: 云端分享尚未完全配置，请重新运行设置向导。

source: Credentials missing
ja: 認証情報がありません
ko: 자격 증명 없음
zh_hans: 凭证缺失

source: Couldn't read the Access Key or Secret Access Key from Keychain. Re-run the wizard to re-enter them.
ja: キーチェーンから Access Key または Secret Access Key を読み取れませんでした。ウィザードを再実行して再入力してください。
ko: 키체인에서 Access Key 또는 Secret Access Key를 읽을 수 없습니다. 마법사를 다시 실행하여 다시 입력하세요.
zh_hans: 无法从钥匙串中读取 Access Key 或 Secret Access Key，请重新运行设置向导以重新输入。

source: Connection works
ja: 接続成功
ko: 연결 성공
zh_hans: 连接正常

source: Round-trip in %.1fs · Test file uploaded and removed cleanly.
ja: 往復 %.1f 秒 · テストファイルを正常にアップロードして削除しました。
ko: 왕복 %.1f초 · 테스트 파일을 정상적으로 업로드하고 삭제했습니다.
zh_hans: 往返 %.1f 秒 · 测试文件已成功上传并清理。

source: Test failed
ja: テスト失敗
ko: 테스트 실패
zh_hans: 测试失败

source: Configuration is incomplete. Re-run the wizard.
ja: 設定が未完了です。ウィザードを再実行してください。
ko: 설정이 완료되지 않았습니다. 마법사를 다시 실행하세요.
zh_hans: 配置不完整，请重新运行设置向导。

source: Cloudflare rejected the credentials. Verify the Access Key and Secret have Object Read & Write on this bucket.
ja: Cloudflare が認証情報を拒否しました。Access Key と Secret がこのバケットに Object Read & Write 権限を持つか確認してください。
ko: Cloudflare가 자격 증명을 거부했습니다. Access Key와 Secret이 이 버킷에 대해 Object Read & Write 권한을 가지고 있는지 확인하세요.
zh_hans: Cloudflare 拒绝了该凭证，请确认 Access Key 和 Secret 对此存储桶具有 Object Read & Write 权限。

source: Invalid public URL prefix: %@
ja: 無効な公開 URL プレフィックス: %@
ko: 유효하지 않은 공개 URL 접두사: %@
zh_hans: 公开 URL 前缀无效：%@

source: Network error: %@
ja: ネットワークエラー: %@
ko: 네트워크 오류: %@
zh_hans: 网络错误：%@

source: Storage quota exceeded — free up space in the Cloudflare dashboard.
ja: ストレージ容量を超えました — Cloudflare ダッシュボードでスペースを解放してください。
ko: 저장 공간이 초과되었습니다 — Cloudflare 대시보드에서 공간을 확보하세요.
zh_hans: 存储配额已满，请在 Cloudflare 控制台释放空间。

source: Upload worked, but the file isn't publicly reachable. Enable Public access on the bucket in Cloudflare.
ja: アップロードは成功しましたが、ファイルに公開アクセスできません。Cloudflare でバケットの Public access を有効にしてください。
ko: 업로드는 성공했지만 파일에 공개적으로 접근할 수 없습니다. Cloudflare에서 버킷의 Public access를 활성화하세요.
zh_hans: 上传成功，但文件无法公开访问，请在 Cloudflare 中启用存储桶的 Public access。

source: Cloud Share Setup
ja: クラウド共有の設定
ko: 클라우드 공유 설정
zh_hans: 云端分享设置

source: Back
ja: 戻る
ko: 뒤로
zh_hans: 返回

source: Next
ja: 次へ
ko: 다음
zh_hans: 下一步

source: Could not save credentials to Keychain: %@
ja: キーチェーンへの認証情報の保存に失敗しました: %@
ko: 키체인에 자격 증명을 저장할 수 없습니다: %@
zh_hans: 无法将凭证保存到钥匙串：%@

source: Looks short — Cloudflare Account IDs are 32 hex characters
ja: 短すぎます — Cloudflare の Account ID は 32 桁の 16 進数です
ko: 너무 짧습니다 — Cloudflare Account ID는 32자리 16진수입니다
zh_hans: 看起来太短了 — Cloudflare Account ID 是 32 位十六进制字符

source: Bucket names must be lowercase, no spaces
ja: バケット名は小文字のみ、スペース不可
ko: 버킷 이름은 소문자만 가능하며 공백은 허용되지 않습니다
zh_hans: 存储桶名称必须小写，不含空格

source: Cloudflare R2 Access Key IDs are typically 32+ chars. This looks like an API token instead — verify you created an R2 token, not a regular API token.
ja: Cloudflare R2 の Access Key ID は通常 32 文字以上です。これは API トークンのように見えます — R2 トークンを作成したか確認してください。
ko: Cloudflare R2 Access Key ID는 보통 32자 이상입니다. 이것은 API 토큰처럼 보입니다 — R2 토큰을 생성했는지 확인하세요.
zh_hans: Cloudflare R2 的 Access Key ID 通常超过 32 个字符，这看起来像是 API 令牌 — 请确认创建的是 R2 令牌而非普通 API 令牌。

source: Uploading test file…
ja: テストファイルをアップロード中…
ko: 테스트 파일 업로드 중…
zh_hans: 正在上传测试文件…

source: Fetching public URL…
ja: 公開 URL を取得中…
ko: 공개 URL 가져오는 중…
zh_hans: 正在获取公开 URL…

source: Cleaning up…
ja: クリーンアップ中…
ko: 정리 중…
zh_hans: 正在清理…

source: Step 1 — Introduction
ja: ステップ 1 — はじめに
ko: 1단계 — 소개
zh_hans: 第 1 步 — 简介

source: Capso uploads to **your own cloud storage** — never our servers. You bring the bucket, you own the files, you keep the bill. We just hand you the share link.
ja: Capso はファイルを**あなた自身のクラウドストレージ**にアップロードします — 当社のサーバーには送りません。バケットはあなたのもの、ファイルもあなたのもの、料金もあなた負担。私たちは共有リンクをお渡しするだけです。
ko: Capso는 파일을 **내 클라우드 스토리지**에 업로드합니다 — 저희 서버에는 절대 저장되지 않습니다. 버킷은 내 것, 파일도 내 것, 비용도 내가 냅니다. 저희는 공유 링크만 전달합니다.
zh_hans: Capso 将文件上传到**您自己的云存储** — 从不经过我们的服务器。存储桶是您的，文件是您的，费用也由您支付。我们只是把分享链接交到您手中。

source: Yours forever.
ja: 永遠にあなたのもの。
ko: 영원히 내 것.
zh_hans: 永久属于您。

source: Files live in your account. Cancel Capso, keep your screenshots.
ja: ファイルはあなたのアカウントに保存されます。Capso を解約しても、スクリーンショットはそのまま残ります。
ko: 파일은 내 계정에 저장됩니다. Capso를 취소해도 스크린샷은 그대로 유지됩니다.
zh_hans: 文件保存在您的账户中。取消 Capso 订阅，截图依然保留。

source: Free tier friendly.
ja: 無料プランで十分。
ko: 무료 플랜으로 충분.
zh_hans: 免费套餐即可使用。

source: Cloudflare R2 includes 10 GB and zero egress fees.
ja: Cloudflare R2 は 10 GB の無料ストレージと 0 円の下り転送費を提供します。
ko: Cloudflare R2는 10GB 무료 저장 공간과 제로 이그레스 요금을 제공합니다.
zh_hans: Cloudflare R2 提供 10 GB 免费存储，且无出流量费用。

source: Five minutes to set up.
ja: 設定は 5 分で完了。
ko: 5분이면 설정 완료.
zh_hans: 五分钟完成设置。

source: Paste four keys, test, done.
ja: 4 つのキーを貼り付けて、テストして、完了。
ko: 네 가지 키를 붙여 넣고, 테스트하면 끝.
zh_hans: 粘贴四个密钥，测试，完成。

source: Already have credentials? You'll be done in under a minute.
ja: 認証情報をお持ちの方は 1 分以内に設定できます。
ko: 이미 자격 증명이 있으신가요? 1분 이내로 완료할 수 있습니다.
zh_hans: 已有凭证？不到一分钟即可完成设置。

source: Step 2 — Provider
ja: ステップ 2 — プロバイダー
ko: 2단계 — 제공업체
zh_hans: 第 2 步 — 服务商

source: Choose a storage provider
ja: ストレージプロバイダーを選択
ko: 스토리지 제공업체 선택
zh_hans: 选择存储服务商

source: Capso speaks the S3 protocol, so any S3-compatible bucket works. We recommend Cloudflare R2 — generous free tier and no egress fees.
ja: Capso は S3 プロトコルに対応しているため、S3 互換のバケットであれば利用できます。Cloudflare R2 を推奨します — 無料枠が充実しており、下り転送費もかかりません。
ko: Capso는 S3 프로토콜을 지원하므로 S3 호환 버킷이라면 모두 사용할 수 있습니다. Cloudflare R2를 권장합니다 — 무료 용량이 넉넉하고 이그레스 요금이 없습니다.
zh_hans: Capso 支持 S3 协议，任何 S3 兼容的存储桶均可使用。推荐 Cloudflare R2 — 免费额度充足，且无出流量费用。

source: 10 GB free · $0 egress · S3-compatible
ja: 10 GB 無料 · $0 下り転送 · S3 互換
ko: 10 GB 무료 · $0 이그레스 · S3 호환
zh_hans: 10 GB 免费 · $0 出流量 · S3 兼容

source: RECOMMENDED
ja: 推奨
ko: 추천
zh_hans: 推荐

source: 10 GB free · pay-as-you-go after
ja: 10 GB 無料 · 超過分は従量課金
ko: 10 GB 무료 · 초과 시 종량제
zh_hans: 10 GB 免费 · 超出后按量计费

source: COMING SOON
ja: 近日公開
ko: 출시 예정
zh_hans: 即将推出

source: The original. AWS account required.
ja: 元祖 S3。AWS アカウントが必要です。
ko: 원조 S3. AWS 계정이 필요합니다.
zh_hans: 元老级 S3，需要 AWS 账户。

source: Want a provider added? Open an issue on GitHub
ja: 他のプロバイダーを追加してほしい場合は GitHub でリクエストしてください
ko: 다른 제공업체를 추가하고 싶으신가요? GitHub에서 이슈를 열어주세요
zh_hans: 想添加其他服务商？请在 GitHub 提交 Issue

source: Create a bucket
ja: バケットを作成
ko: 버킷 생성
zh_hans: 创建存储桶

source: Enable public access
ja: パブリックアクセスを有効化
ko: 공개 액세스 활성화
zh_hans: 启用公开访问

source: Create an API token
ja: API トークンを作成
ko: API 토큰 생성
zh_hans: 创建 API 令牌

source: Copy the four values
ja: 4 つの値をコピー
ko: 네 가지 값 복사
zh_hans: 复制这四个值

source: Step 3 — Cloudflare
ja: ステップ 3 — Cloudflare
ko: 3단계 — Cloudflare
zh_hans: 第 3 步 — Cloudflare

source: Get your R2 credentials
ja: R2 の認証情報を取得
ko: R2 자격 증명 가져오기
zh_hans: 获取 R2 凭证

source: Open the Cloudflare dashboard in your browser and follow these four steps. Keep this window open — you'll paste the keys on the next screen.
ja: ブラウザで Cloudflare ダッシュボードを開き、以下の 4 つの手順を実行してください。このウィンドウは開いたままにしておいてください — 次の画面でキーを貼り付けます。
ko: 브라우저에서 Cloudflare 대시보드를 열고 아래 네 단계를 따르세요. 이 창을 열어 두세요 — 다음 화면에서 키를 붙여 넣을 것입니다.
zh_hans: 在浏览器中打开 Cloudflare 控制台，按照以下四个步骤操作。请保持此窗口打开 — 您将在下一个界面粘贴密钥。

source: Open R2 Dashboard
ja: R2 ダッシュボードを開く
ko: R2 대시보드 열기
zh_hans: 打开 R2 控制台

source: Step 4 — Credentials
ja: ステップ 4 — 認証情報
ko: 4단계 — 자격 증명
zh_hans: 第 4 步 — 凭证

source: Paste your credentials
ja: 認証情報を貼り付け
ko: 자격 증명 붙여넣기
zh_hans: 粘贴您的凭证

source: These are stored in macOS Keychain on this Mac and never sent anywhere except your bucket.
ja: これらの情報はこの Mac の macOS キーチェーンに保存され、あなたのバケット以外には送信されません。
ko: 이 정보는 이 Mac의 macOS 키체인에 저장되며, 내 버킷 이외에는 어디에도 전송되지 않습니다.
zh_hans: 这些信息存储在此 Mac 的 macOS 钥匙串中，除您的存储桶外不会发送到任何地方。

source: 32-character hex
ja: 32 桁の 16 進数
ko: 32자리 16진수
zh_hans: 32 位十六进制

source: Bucket name
ja: バケット名
ko: 버킷 이름
zh_hans: 存储桶名称

source: lowercase, hyphens OK
ja: 小文字、ハイフン可
ko: 소문자, 하이픈 허용
zh_hans: 小写字母，允许连字符

source: 32+ characters
ja: 32 文字以上
ko: 32자 이상
zh_hans: 32+ 个字符

source: Won't be shown again
ja: 再表示はされません
ko: 다시 표시되지 않습니다
zh_hans: 不会再次显示

source: Stored in Keychain · Encrypted at rest · Never leaves this device
ja: キーチェーンに保存 · 保管時は暗号化 · デバイス外に出ることはありません
ko: 키체인에 저장 · 저장 시 암호화 · 이 기기를 벗어나지 않음
zh_hans: 存储在钥匙串中 · 静态加密 · 永不离开此设备

source: Step 5 — Public URL
ja: ステップ 5 — 公開 URL
ko: 5단계 — 공개 URL
zh_hans: 第 5 步 — 公开 URL

source: Public URL & test
ja: 公開 URL とテスト
ko: 공개 URL 및 테스트
zh_hans: 公开 URL 与测试

source: Capso prepends this to every uploaded filename to build the share link. If you set up a custom domain in R2, paste that here — otherwise use the pub-…r2.dev URL from your bucket's Public access section.
ja: Capso はこれをアップロードされたファイル名の先頭に付加して共有リンクを生成します。R2 でカスタムドメインを設定した場合はそれを貼り付けてください — そうでない場合はバケットの Public access セクションにある pub-…r2.dev の URL を使用してください。
ko: Capso는 업로드된 파일명 앞에 이것을 붙여 공유 링크를 만듭니다. R2에서 커스텀 도메인을 설정했다면 여기에 붙여 넣으세요 — 그렇지 않은 경우 버킷의 Public access 섹션에 있는 pub-…r2.dev URL을 사용하세요.
zh_hans: Capso 会将此前缀拼接到每个上传文件名前，生成分享链接。如果您在 R2 中配置了自定义域名，请粘贴于此 — 否则请使用存储桶 Public access 部分中的 pub-…r2.dev URL。

source: Capso prepends this to every uploaded filename to build the share link. Use your custom domain if you connected one, otherwise use the pub-…r2.dev URL from the Public Development URL section.
ja: Capso はアップロードされたファイル名の前にこれを付加して共有リンクを生成します。カスタムドメインを接続した場合はそれを、そうでなければ Public Development URL セクションの pub-…r2.dev URL を使用してください。
ko: Capso는 업로드된 모든 파일 이름 앞에 이것을 붙여 공유 링크를 만듭니다. 사용자 지정 도메인을 연결한 경우 해당 도메인을, 그렇지 않으면 Public Development URL 섹션의 pub-…r2.dev URL을 사용하세요.
zh_hans: Capso 会把这段前缀加在每个上传文件名前面来生成分享链接。如果你连接了自定义域名就用那个，否则用 Public Development URL 章节里的 pub-…r2.dev URL。

source: Public URL prefix
ja: 公開 URL プレフィックス
ko: 공개 URL 접두사
zh_hans: 公开 URL 前缀

source: Final share link will look like
ja: 最終的な共有リンクの形式
ko: 최종 공유 링크 형식
zh_hans: 最终分享链接示例

source: Test Connection
ja: 接続をテスト
ko: 연결 테스트
zh_hans: 测试连接

source: Connection works.
ja: 接続成功。
ko: 연결 성공.
zh_hans: 连接正常。

source: Round-trip in %.1fs · Test file written and removed cleanly.
ja: 往復 %.1f 秒 · テストファイルを正常に書き込み・削除しました。
ko: 왕복 %.1f초 · 테스트 파일을 정상적으로 작성하고 삭제했습니다.
zh_hans: 往返 %.1f 秒 · 测试文件已成功写入并清理。

source: Re-test
ja: 再テスト
ko: 재테스트
zh_hans: 重新测试

source: Configuration is incomplete.
ja: 設定が未完了です。
ko: 설정이 완료되지 않았습니다.
zh_hans: 配置不完整。

source: One or more required values are missing. Go back and double-check the previous step.
ja: 1 つ以上の必須項目が入力されていません。前の手順に戻って確認してください。
ko: 하나 이상의 필수 값이 누락되었습니다. 이전 단계로 돌아가 다시 확인하세요.
zh_hans: 一个或多个必填项缺失，请返回上一步仔细检查。

source: Those credentials were rejected.
ja: 認証情報が拒否されました。
ko: 자격 증명이 거부되었습니다.
zh_hans: 该凭证被拒绝。

source: Cloudflare returned an authentication error. Verify the Access Key ID and Secret Access Key, and that the token has Object Read & Write permission on this bucket.
ja: Cloudflare が認証エラーを返しました。Access Key ID と Secret Access Key を確認し、このバケットに対して Object Read & Write 権限があるか確認してください。
ko: Cloudflare에서 인증 오류가 반환되었습니다. Access Key ID와 Secret Access Key를 확인하고, 해당 토큰이 이 버킷에 대해 Object Read & Write 권한을 갖고 있는지 확인하세요.
zh_hans: Cloudflare 返回了身份验证错误，请验证 Access Key ID 和 Secret Access Key，并确认该令牌对此存储桶具有 Object Read & Write 权限。

source: That URL prefix doesn't look right.
ja: この URL プレフィックスは正しくないようです。
ko: URL 접두사가 올바르지 않은 것 같습니다.
zh_hans: 该 URL 前缀看起来不正确。

source: Network error reaching Cloudflare.
ja: Cloudflare への接続でネットワークエラーが発生しました。
ko: Cloudflare에 연결하는 중 네트워크 오류가 발생했습니다.
zh_hans: 连接 Cloudflare 时发生网络错误。

source: Storage quota exceeded.
ja: ストレージ容量の上限に達しました。
ko: 저장 공간 할당량을 초과했습니다.
zh_hans: 存储配额已满。

source: Your R2 account is at its storage limit. Free up space in the Cloudflare dashboard or upgrade your plan.
ja: R2 アカウントがストレージの上限に達しました。Cloudflare ダッシュボードでスペースを解放するか、プランをアップグレードしてください。
ko: R2 계정의 저장 공간이 가득 찼습니다. Cloudflare 대시보드에서 공간을 확보하거나 플랜을 업그레이드하세요.
zh_hans: 您的 R2 账户已达存储上限，请在 Cloudflare 控制台释放空间或升级套餐。

source: The upload worked, but the file isn't publicly reachable.
ja: アップロードは成功しましたが、ファイルに公開アクセスできません。
ko: 업로드는 성공했지만 파일에 공개적으로 접근할 수 없습니다.
zh_hans: 上传成功，但文件无法公开访问。

source: The bucket needs Public access enabled. Open the Cloudflare dashboard → your bucket → Settings → Public access, then re-test.
ja: バケットの Public access を有効にする必要があります。Cloudflare ダッシュボード → バケット → Settings → Public access を開いて、再テストしてください。
ko: 버킷에 Public access를 활성화해야 합니다. Cloudflare 대시보드 → 버킷 → Settings → Public access를 열고 다시 테스트하세요.
zh_hans: 需要为存储桶启用 Public access。请打开 Cloudflare 控制台 → 存储桶 → Settings → Public access，然后重新测试。

source: The bucket isn't publicly readable. Open the Cloudflare dashboard → your bucket → Settings, then enable Public Development URL or add a Custom Domain. Then re-test.
ja: バケットが公開読み取り可能になっていません。Cloudflare ダッシュボード → バケット → Settings を開き、Public Development URL を有効にするか Custom Domain を追加してください。その後、再テストしてください。
ko: 버킷이 공개적으로 읽을 수 없습니다. Cloudflare 대시보드 → 버킷 → Settings를 열고 Public Development URL을 활성화하거나 Custom Domain을 추가하세요. 그런 다음 다시 테스트하세요.
zh_hans: bucket 当前不可公开读取。打开 Cloudflare 控制台 → 你的 bucket → Settings，然后启用 Public Development URL 或添加 Custom Domain。然后重新测试。

source: Something went wrong.
ja: エラーが発生しました。
ko: 오류가 발생했습니다.
zh_hans: 出现了错误。

source: Cloud Share is ready
ja: クラウド共有の準備ができました
ko: 클라우드 공유 준비 완료
zh_hans: 云端分享已就绪

source: Next time you capture a screenshot, click the cloud icon in Quick Access — your share link will be on your clipboard, ready to paste in Slack or Discord.
ja: 次回スクリーンショットを撮ったら、Quick Access のクラウドアイコンをクリックするだけで、Slack や Discord にすぐ貼り付けられる共有リンクがクリップボードにコピーされます。
ko: 다음에 스크린샷을 캡처하면 Quick Access의 클라우드 아이콘을 클릭하세요 — Slack이나 Discord에 바로 붙여 넣을 수 있는 공유 링크가 클립보드에 복사됩니다.
zh_hans: 下次截图后，点击快速访问中的云端图标 — 分享链接将复制到剪贴板，可直接粘贴到 Slack 或 Discord。

source: Take a test capture
ja: テストキャプチャを撮る
ko: 테스트 캡처 촬영
zh_hans: 拍一张测试截图

source: Hide secret
ja: シークレットを隠す
ko: 시크릿 숨기기
zh_hans: 隐藏密钥

source: Reveal secret
ja: シークレットを表示
ko: 시크릿 표시
zh_hans: 显示密钥

source: Uploaded to cloud
ja: クラウドにアップロード済み
ko: 클라우드에 업로드됨
zh_hans: 已上传至云端

source: Copy cloud link
ja: クラウドリンクをコピー
ko: 클라우드 링크 복사
zh_hans: 复制云端链接

source: Upload to cloud
ja: クラウドにアップロード
ko: 클라우드에 업로드
zh_hans: 上传到云端

source: Cloud credentials are invalid.
ja: クラウドの認証情報が無効です。
ko: 클라우드 자격 증명이 유효하지 않습니다.
zh_hans: 云端凭证无效。

source: Upload OK but public URL unreachable.
ja: アップロード成功、ただし公開 URL にアクセスできません。
ko: 업로드 성공, 하지만 공개 URL에 접근할 수 없습니다.
zh_hans: 上传成功，但公开 URL 无法访问。

source: Invalid URL prefix: %@
ja: 無効な URL プレフィックス: %@
ko: 유효하지 않은 URL 접두사: %@
zh_hans: URL 前缀无效：%@

source: Copy Cloud Link
ja: クラウドリンクをコピー
ko: 클라우드 링크 복사
zh_hans: 复制云端链接

source: Delete capture?
ja: キャプチャを削除しますか？
ko: 캡처를 삭제할까요?
zh_hans: 删除截图？

source: This will remove the capture from this Mac. You can also remove the cloud copy.
ja: このキャプチャを Mac から削除します。クラウドのコピーも削除できます。
ko: 이 캡처가 이 Mac에서 삭제됩니다. 클라우드 복사본도 삭제할 수 있습니다.
zh_hans: 这将从此 Mac 中删除该截图。您也可以同时删除云端副本。

source: This will remove the capture from this Mac.
ja: このキャプチャを Mac から削除します。
ko: 이 캡처가 이 Mac에서 삭제됩니다.
zh_hans: 这将从此 Mac 中删除该截图。

source: Also delete from cloud
ja: クラウドからも削除
ko: 클라우드에서도 삭제
zh_hans: 同时从云端删除

source: Cloud Share busy
ja: クラウド共有がビジー中
ko: 클라우드 공유 사용 중
zh_hans: 云端分享忙碌中

source: Previous upload still in progress — try again in a moment.
ja: 前回のアップロードがまだ進行中です — もう一度お試しください。
ko: 이전 업로드가 아직 진행 중입니다 — 잠시 후 다시 시도하세요.
zh_hans: 上一次上传仍在进行中——稍后再试。

source: Cloud share ready
ja: クラウド共有の準備完了
ko: 클라우드 공유 준비 완료
zh_hans: 云端分享已就绪

source: Link copied to clipboard.
ja: リンクをクリップボードにコピーしました。
ko: 링크가 클립보드에 복사되었습니다.
zh_hans: 链接已复制到剪贴板。

source: Cloud share failed
ja: クラウド共有に失敗しました
ko: 클라우드 공유 실패
zh_hans: 云端分享失败

source: Couldn't encode capture for upload.
ja: 撮影のエンコードに失敗しました。
ko: 캡처를 인코딩할 수 없습니다.
zh_hans: 无法编码截图以上传。

source: Couldn't fully clear Keychain
ja: Keychain を完全に削除できませんでした
ko: Keychain을 완전히 지울 수 없습니다
zh_hans: 未能完全清除 Keychain

source: Some credentials may still be in Keychain: %@. Open 'Keychain Access.app' and search for 'com.awesomemacapps.capso.share' to remove them manually.
ja: 一部の資格情報が Keychain に残っている可能性があります：%@。 「キーチェーンアクセス.app」を開き、'com.awesomemacapps.capso.share' で検索して手動で削除してください。
ko: 일부 자격 증명이 Keychain에 남아 있을 수 있습니다: %@. '키체인 접근.app'을 열고 'com.awesomemacapps.capso.share'를 검색하여 수동으로 삭제하세요.
zh_hans: 部分凭据可能仍保留在 Keychain 中：%@。 请打开“钥匙串访问.app”，搜索 'com.awesomemacapps.capso.share' 手动删除。

source: All-in-One
ja: オールインワン
ko: 올인원
zh_hans: 全能截图

source: Area
ja: 範囲
ko: 영역
zh_hans: 区域

source: Scrolling
ja: スクロール
ko: 스크롤
zh_hans: 滚动

source: Timer
ja: タイマー
ko: 타이머
zh_hans: 计时器

source: Annotate in place
ja: その場で注釈
ko: 제자리에서 주석
zh_hans: 原位标注

source: Copy selected area
ja: 選択範囲をコピー
ko: 선택 영역 복사
zh_hans: 复制所选区域

source: Capture preset
ja: キャプチャプリセット
ko: 캡처 프리셋
zh_hans: 截图预设

source: Selected area size
ja: 選択範囲のサイズ
ko: 선택 영역 크기
zh_hans: 所选区域尺寸

source: Free
ja: 自由
ko: 자유
zh_hans: 自由

source: Self-Timer
ja: セルフタイマー
ko: 셀프 타이머
zh_hans: 延时截图

source: Capture Previous Area
ja: 前回の範囲をキャプチャ
ko: 이전 영역 캡처
zh_hans: 截取上一区域

source: Font Size
ja: フォントサイズ
ko: 글꼴 크기
zh_hans: 字体大小

source: Block Size
ja: ブロックサイズ
ko: 블록 크기
zh_hans: 块大小

source: Counter Size
ja: カウンターサイズ
ko: 카운터 크기
zh_hans: 序号大小

source: Highlighter Width
ja: ハイライター幅
ko: 형광펜 너비
zh_hans: 荧光笔宽度

source: Line
ja: 線
ko: 선
zh_hans: 直线

source: Line Width
ja: 線の太さ
ko: 선 두께
zh_hans: 线条宽度

source: Red
ja: 赤
ko: 빨강
zh_hans: 红色

source: Orange
ja: オレンジ
ko: 주황
zh_hans: 橙色

source: Yellow
ja: 黄
ko: 노랑
zh_hans: 黄色

source: Green
ja: 緑
ko: 초록
zh_hans: 绿色

source: Blue
ja: 青
ko: 파랑
zh_hans: 蓝色

source: Purple
ja: 紫
ko: 보라
zh_hans: 紫色

source: White
ja: 白
ko: 흰색
zh_hans: 白色

source: Customizable Shortcuts
ja: カスタマイズ可能なショートカット
ko: 사용자 지정 단축키
zh_hans: 自定义快捷键

source: Contextual Shortcuts
ja: コンテキストショートカット
ko: 상황별 단축키
zh_hans: 上下文快捷键

source: Click a customizable shortcut to record a new combination. Press Esc to cancel or Delete to remove. Contextual shortcuts are fixed and work only while that panel is active.
ja: カスタマイズ可能なショートカットをクリックして新しい組み合わせを記録します。Escでキャンセル、Deleteで削除します。コンテキストショートカットは固定で、そのパネルがアクティブな間だけ機能します。
ko: 사용자 지정 가능한 단축키를 클릭해 새 조합을 기록하세요. Esc로 취소하고 Delete로 제거합니다. 상황별 단축키는 고정되어 있으며 해당 패널이 활성화된 동안에만 작동합니다.
zh_hans: 点击可自定义快捷键以录制新的组合。按 Esc 取消，按 Delete 移除。上下文快捷键是固定的，仅在对应面板处于活动状态时生效。

source: Save selected area
ja: 選択範囲を保存
ko: 선택 영역 저장
zh_hans: 保存所选区域

source: Pin selected area
ja: 選択範囲をピン留め
ko: 선택 영역 고정
zh_hans: 固定所选区域

source: Copy selected area (%@)
ja: 選択範囲をコピー（%@）
ko: 선택 영역 복사(%@)
zh_hans: 复制所选区域（%@）

source: Save selected area (%@)
ja: 選択範囲を保存（%@）
ko: 선택 영역 저장(%@)
zh_hans: 保存所选区域（%@）

source: Pin selected area (%@)
ja: 選択範囲をピン留め（%@）
ko: 선택 영역 고정(%@)
zh_hans: 固定所选区域（%@）

source: Cancel (%@)
ja: キャンセル（%@）
ko: 취소(%@)
zh_hans: 取消（%@）

source: Screenshot Quality
ja: スクリーンショット品質
ko: 스크린샷 품질
zh_hans: 截图品质

source: Applies to screenshot files
ja: スクリーンショットファイルに適用
ko: 스크린샷 파일에 적용
zh_hans: 适用于截图文件

source: Monthly Screenshot Folders
ja: 月別スクリーンショットフォルダ
ko: 월별 스크린샷 폴더
zh_hans: 按月保存截图文件夹

source: Save screenshots into yyyy-MM subfolders
ja: スクリーンショットを yyyy-MM サブフォルダに保存
ko: 스크린샷을 yyyy-MM 하위 폴더에 저장
zh_hans: 将截图保存到 yyyy-MM 子文件夹

source: Cloud Share
ja: クラウド共有
ko: 클라우드 공유
zh_hans: 云端分享

source: Status
ja: ステータス
ko: 상태
zh_hans: 状态

source: Provider
ja: プロバイダ
ko: 제공업체
zh_hans: 服务商

source: Public URL Prefix
ja: 公開URLプレフィックス
ko: 공개 URL 접두사
zh_hans: 公共 URL 前缀

source: Bucket
ja: バケット
ko: 버킷
zh_hans: 存储桶

source: Actions
ja: 操作
ko: 작업
zh_hans: 操作

source: Verify the bucket is reachable
ja: バケットに到達できるか確認
ko: 버킷에 접근할 수 있는지 확인
zh_hans: 验证存储桶是否可访问

source: Reset Configuration
ja: 設定をリセット
ko: 구성 재설정
zh_hans: 重置配置

source: Remove all Cloud Share credentials
ja: すべてのクラウド共有認証情報を削除
ko: 모든 클라우드 공유 자격 증명 제거
zh_hans: 移除所有云端分享凭据

source: Remember Last Recording Area
ja: 最後の録画範囲を記憶
ko: 마지막 녹화 영역 기억
zh_hans: 记住上次录屏区域

source: Automatically Install Updates
ja: アップデートを自動インストール
ko: 업데이트 자동 설치
zh_hans: 自动安装更新

source: Install updates in the background when available
ja: 利用可能なアップデートをバックグラウンドでインストール
ko: 사용 가능한 업데이트를 백그라운드에서 설치
zh_hans: 有可用更新时在后台安装

source: 1 Week
ja: 1週間
ko: 1주
zh_hans: 1 周

source: 2 Weeks
ja: 2週間
ko: 2주
zh_hans: 2 周

source: 1 Month
ja: 1か月
ko: 1개월
zh_hans: 1 个月

source: Diagnostic Logging
ja: 診断ログ
ko: 진단 로그
zh_hans: 诊断日志

source: Write local troubleshooting logs when enabled
ja: 有効にするとローカルのトラブルシューティングログを書き込みます
ko: 활성화하면 로컬 문제 해결 로그를 기록합니다
zh_hans: 启用后写入本地故障排查日志

source: Diagnostic Logs
ja: 診断ログ
ko: 진단 로그
zh_hans: 诊断日志

source: Open Capso's local log folder
ja: Capsoのローカルログフォルダを開く
ko: Capso 로컬 로그 폴더 열기
zh_hans: 打开 Capso 的本地日志文件夹

source: Crash Reports
ja: クラッシュレポート
ko: 충돌 보고서
zh_hans: 崩溃报告

source: Open macOS DiagnosticReports
ja: macOS DiagnosticReportsを開く
ko: macOS DiagnosticReports 열기
zh_hans: 打开 macOS DiagnosticReports

source: Include the mouse pointer in screenshots
ja: スクリーンショットにマウスポインタを含める
ko: 스크린샷에 마우스 포인터 포함
zh_hans: 在截图中包含鼠标指针

source: Default Duration
ja: デフォルト時間
ko: 기본 시간
zh_hans: 默认时长

source: Delay before the screenshot fires
ja: スクリーンショット撮影までの遅延
ko: 스크린샷 촬영 전 지연 시간
zh_hans: 截图触发前的延迟

source: Tick Sound
ja: カウント音
ko: 틱 소리
zh_hans: 倒计时提示音

source: Play a sound on each second of the countdown
ja: カウントダウンの各秒で音を鳴らす
ko: 카운트다운 매초 소리 재생
zh_hans: 倒计时每秒播放提示音
